In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from sqlalchemy.ext.automap import automap_base
from config import (user, password, host, port, database)

In [2]:
from sqlalchemy import create_engine
engine = create_engine(f'postgresql://{user}:{password}@{host}:{port}/{database}')
conn = engine.connect()

In [3]:
base = automap_base()
base.prepare(engine, reflect=True)
base.classes.keys()

['titles', 'employees', 'departments', 'salaries']

In [7]:
#1. List the following details of each employee: employee number, last name, first name, sex, and salary.
employeespd = pd.read_sql('select employees.first_name, employees.last_name, employees.sex, salaries.salary from employees inner join salaries on employees.emp_no=salaries.emp_no', conn)
employeespd

       first_name     last_name sex  salary
0           Berry          Babb   F   48973
1           Perry         Lorho   F   40000
2           Roddy        Karnin   M   43548
3        Feixiong        Poujol   F   63377
4          Wonhee        Talmon   F   40000
...           ...           ...  ..     ...
300019      Jaana      Klyachko   F   40000
300020    Martijn  Bernardeschi   F   40000
300021        Fay          Perz   M   59703
300022   Xiaoheng      Michaels   M   48038
300023   Patricio     Pocchiola   M   40000

[300024 rows x 4 columns]

In [17]:
#2. List first name, last name, and hire date for employees who were hired in 1986.
employees1986 = pd.read_sql("select first_name, last_name, hire_date from employees where hire_date >= '1986-01-01 00:00:00' and hire_date < '1987-01-01 00:00:00' ", conn)
employees1986

      first_name    last_name   hire_date
0           Eran     Cusworth  1986-11-14
1          Bojan     Zallocco  1986-10-14
2          Nevio       Demizu  1986-05-18
3           Ziva       Vecchi  1986-07-03
4          Mohit        Speek  1986-01-14
...          ...          ...         ...
36145      Uriel     Heijenga  1986-06-30
36146      Ziyad  Constantine  1986-02-28
36147     Yishay   Maksimenko  1986-01-27
36148     Yannik        Ranai  1986-04-06
36149     Chenyi     Orlowska  1986-12-25

[36150 rows x 3 columns]

In [20]:
#3. List the manager of each department with the following information: department number, department name, the manager's employee number, last name, first name.
deptmanagers = pd.read_sql("select departments.dept_no, departments.dept_name, employees.emp_no, employees.first_name, employees.last_name from dept_manager inner join departments on departments.dept_no=dept_manager.dept_no inner join employees on dept_manager.emp_no = employees.emp_no", conn)
deptmanagers

   dept_no           dept_name  emp_no   first_name     last_name
0     d001           Marketing  110022    Margareta    Markovitch
1     d001           Marketing  110039     Vishwani      Minakawa
2     d002             Finance  110085         Ebru         Alpin
3     d002             Finance  110114        Isamu    Legleitner
4     d003     Human Resources  110183      Shirish  Ossenbruggen
5     d003     Human Resources  110228      Karsten       Sigstam
6     d004          Production  110303    Krassimir       Wegerle
7     d004          Production  110344       Rosine         Cools
8     d004          Production  110386         Shem        Kieras
9     d004          Production  110420        Oscar      Ghazalie
10    d005         Development  110511     DeForest      Hagimont
11    d005         Development  110567         Leon      DasSarma
12    d006  Quality Management  110725    Peternela       Onuegbe
13    d006  Quality Management  110765       Rutger       Hofmeyr
14    d006  Quality Management  110800       Sanjoy       Quadeer
15    d006  Quality Management  110854         Dung         Pesch
16    d007               Sales  111035  Przemyslawa     Kaelbling
17    d007               Sales  111133        Hauke         Zhang
18    d008            Research  111400         Arie       Staelin
19    d008            Research  111534       Hilary        Kambil
20    d009    Customer Service  111692        Tonny   Butterworth
21    d009    Customer Service  111784        Marjo    Giarratana
22    d009    Customer Service  111877      Xiaobin      Spinelli
23    d009    Customer Service  111939      Yuchang       Weedman

In [23]:
#4. List the department of each employee with the following information: employee number, last name, first name, and department name.
emp_depts = pd.read_sql("select employees.emp_no, employees.last_name, employees.first_name, employees.first_name, departments.dept_name from employees inner join dept_emp on employees.emp_no=dept_emp.emp_no inner join departments on dept_emp.dept_no=departments.dept_no", conn)
emp_depts

        emp_no    last_name first_name first_name           dept_name
0        10005     Maliniak    Kyoichi    Kyoichi     Human Resources
1        10010     Piveteau  Duangkaew  Duangkaew          Production
2        10010     Piveteau  Duangkaew  Duangkaew  Quality Management
3        10011        Sluis       Mary       Mary    Customer Service
4        10013       Terkki  Eberhardt  Eberhardt     Human Resources
...        ...          ...        ...        ...                 ...
331598  499948    Paludetto   Cordelia   Cordelia          Production
331599  499972       Leuchs     Katsuo     Katsuo         Development
331600  499985  Lukaszewicz       Gila       Gila            Research
331601  499987       Dusink      Rimli      Rimli               Sales
331602  499998      Breugel   Patricia   Patricia             Finance

[331603 rows x 5 columns]

In [31]:
#5. List first name, last name, and sex for employees whose first name is "Hercules" and last names begin with "B."
bercules = pd.read_sql("select first_name, last_name, sex from employees where first_name='Hercules' and last_name like 'B%%'", conn)
bercules

   first_name      last_name sex
0    Hercules           Baer   M
1    Hercules          Biron   F
2    Hercules          Birge   F
3    Hercules        Berstel   F
4    Hercules      Bernatsky   M
5    Hercules           Bail   F
6    Hercules         Bodoff   M
7    Hercules       Benantar   F
8    Hercules        Basagni   M
9    Hercules  Bernardinello   F
10   Hercules     Baranowski   M
11   Hercules        Bisiani   F
12   Hercules     Benzmuller   M
13   Hercules           Bahr   M
14   Hercules          Biran   F
15   Hercules           Bain   F
16   Hercules        Brendel   F
17   Hercules        Buchter   M
18   Hercules       Barreiro   M
19   Hercules           Baak   M